from itertools import product

k = 0

'''
Маша составляет шестибуквенные слова перестановкой букв слова КАПКАН. 
При этом она избегает слов с двумя подряд одинаковыми буквами. Сколько различных кодов может составить Маша?


'''

for i in product(set('КАПКАН'), repeat=6):
    s = ''.join(i)
    if all([q*2 not in s for q in set('КАПКАН')]):
        k += 1
print(k) #972
